import pytest


@pytest.fixture
def dict_with_examples():
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
    ]


@pytest.fixture
def dict_no_state_executed():
    return [
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
    ]


@pytest.fixture
def dict_same_date():
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 939719570, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512363"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-06-30T02:08:58.425572"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-06-30T02:08:58.425571"},
    ]


@pytest.fixture
def dict_wrong_date_format():
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "21 февраля 2025"},
        {"id": 939719570, "state": "EXECUTED", "date": "12-12-2025"},
        {"id": 594226727, "state": "CANCELED", "date": "03.03.25"},
        {"id": 615064591, "state": "CANCELED", "date": ""},
    ]


@pytest.fixture
def examples_for_generators():
    return [
        {
            "id": 939719570,
            "state": "EXECUTED",
            "date": "2018-06-30T02:08:58.425572",
            "operationAmount": {
                "amount": "9824.07",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод организации",
            "from": "Счет 75106830613657916952",
            "to": "Счет 11776614605963066702",
        },
        {
            "id": 142264268,
            "state": "EXECUTED",
            "date": "2019-04-04T23:20:05.206878",
            "operationAmount": {
                "amount": "79114.93",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод со счета на счет",
            "from": "Счет 19708645243227258542",
            "to": "Счет 75651667383060284188",
        },
        {
            "id": 873106923,
            "state": "EXECUTED",
            "date": "2019-03-23T01:09:46.296404",
            "operationAmount": {
                "amount": "43318.34",
                "currency": {"name": "руб.", "code": "RUB"},
            },
            "description": "Перевод со счета на счет",
            "from": "Счет 44812258784861134719",
            "to": "Счет 74489636417521191160",
        },
        {
            "id": 895315941,
            "state": "EXECUTED",
            "date": "2018-08-19T04:27:37.904916",
            "operationAmount": {
                "amount": "56883.54",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод с карты на карту",
            "from": "Visa Classic 6831982476737658",
            "to": "Visa Platinum 8990922113665229",
        },
        {
            "id": 594226727,
            "state": "CANCELED",
            "date": "2018-09-12T21:27:25.241689",
            "operationAmount": {
                "amount": "67314.70",
                "currency": {"name": "руб.", "code": "RUB"},
            },
            "description": "Перевод организации",
            "from": "Visa Platinum 1246377376343588",
            "to": "Счет 14211924144426031657",
        },
    ]


@pytest.fixture
def answer_json_executed():
    return '''Для обработки выбран JSON-файл.

Распечатываю итоговый список транзакций...

Всего банковских операций в выборке: 
Перевод со счета на счет: 1

---------------------------------------------
23.03.2019 Перевод со счета на счет
Счет **4719 -> Счет **1160
Сумма: 43318.34 RUB
********************************************* \n\n'''


@pytest.fixture
def example_csv_and_xlsx():
    return [
        {
            "id": 873106923,
            "state": "EXECUTED",
            "date": "2019-03-23T01:09:46.296404",
            "amount": "43318.34",
            "currency_name": "руб.",
            "currency_code": "RUB",
            "description": "Перевод со счета на счет",
            "from": "Счет 44812258784861134719",
            "to": "Счет 74489636417521191160",
        },
        {
            "id": 594226727,
            "state": "CANCELED",
            "date": "2018-09-12T21:27:25.241689",
            "amount": "67314.70",
            "currency_name": "руб.",
            "currency_code": "RUB",
            "description": "Перевод организации",
            "from": "Visa Platinum 1246377376343588",
            "to": "Счет 14211924144426031657",
        },
    ]


@pytest.fixture
def answer_csv_executed():
    return ('Для обработки выбран CSV-файл.\n'
 '\n'
 'Распечатываю итоговый список транзакций...\n'
 '\n'
 'Всего банковских операций в выборке: \n'
 'Перевод со счета на счет: 1\n'
 '\n'
 '---------------------------------------------\n'
 '23.03.2019 Перевод со счета на счет\n'
 'Счет **4719 -> Счет **1160\n'
 'Сумма: 43318.34 RUB\n'
 '********************************************* \n'
 '\n')


@pytest.fixture
def answer_xlsx_executed():
    return ('Для обработки выбран XLSX-файл.\n'
 '\n'
 'Распечатываю итоговый список транзакций...\n'
 '\n'
 'Всего банковских операций в выборке: \n'
 'Перевод со счета на счет: 1\n'
 '\n'
 '---------------------------------------------\n'
 '23.03.2019 Перевод со счета на счет\n'
 'Счет **4719 -> Счет **1160\n'
 'Сумма: 43318.34 RUB\n'
 '********************************************* \n'
 '\n')


@pytest.fixture
def answer_no_match():
    return ('Для обработки выбран JSON-файл.\n'
 'Не найдено ни одной транзакции, подходящей под ваши условия фильтрации\n')


@pytest.fixture
def incorrect_input_words():
    return ('Для обработки выбран JSON-файл.\n'
 '\n'
 'Вы ввели некорректное значение, повторите снова\n'
 '\n'
 '\n'
 'Вы ввели некорректное значение, повторите снова\n'
 '\n'
 '\n'
 'Вы ввели некорректное значение, повторите снова\n'
 '\n'
 '\n'
 'Распечатываю итоговый список транзакций...\n'
 '\n'
 'Всего банковских операций в выборке: \n'
 'Перевод со счета на счет: 1\n'
 '\n'
 '---------------------------------------------\n'
 '23.03.2019 Перевод со счета на счет\n'
 'Счет **4719 -> Счет **1160\n'
 'Сумма: 43318.34 RUB\n'
 '********************************************* \n'
 '\n')


@pytest.fixture
def high_sort_xlsx():
    return ('Выбран неверный пункт в меню, повторите ввод.\n'
 'Для обработки выбран XLSX-файл.\n'
 'Статус операции XECU недоступен.\n'
 '\n'
 'Вы ввели некорректное значение, повторите снова\n'
 '\n'
 '\n'
 'Вы ввели некорректное значение, повторите снова\n'
 '\n'
 '\n'
 'Распечатываю итоговый список транзакций...\n'
 '\n'
 'Всего банковских операций в выборке: \n'
 'Перевод со счета на счет: 1\n'
 '\n'
 '---------------------------------------------\n'
 '23.03.2019 Перевод со счета на счет\n'
 'Счет **4719 -> Счет **1160\n'
 'Сумма: 43318.34 RUB\n'
 '********************************************* \n'
 '\n')
